Repository: lafvintech/LAFVIN-M.2-NVMe-SSD-Adapter-For-RPI5
Catalog: docs/locales/*/LC_MESSAGES/about_this_kit.po
Languages: de, es, fr, it, ja, zh_cn

source: LAFVIN M.2 NVMe SSD Adapter For RPI5
de: LAFVIN M.2 NVMe SSD Adapter für RPI5
fr: LAFVIN Adaptateur SSD M.2 NVMe pour RPI5
it: Adattatore SSD M.2 NVMe LAFVIN per RPI5
ja: RPI5用LAFVIN M.2 NVMe SSDアダプタ
zh_cn: 用于 RPI5 的 LAFVIN M.2 NVMe 固态硬盘适配器

source: *LAFVIN M.2 NVMe SSD Adapter*
fr: *Adaptateur SSD M.2 NVMeLAFVIN
it: *Adattatore SSD M.2 NVMe*LAFVIN
ja: *LAFVIN M.2 NVMe SSD アダプタ*.

source: Introduction
de: Einführung
es: Introducción
it: Introduzione
ja: はじめに
zh_cn: 介绍

source: The LAFVIN M.2 NVMe SSD Adapter is an NVMe M.2 SSD PCIe peripheral board (PIP) designed specifically for the Raspberry Pi 5. It utilizes the Pi 5's PCIe interface to connect NVMe M.2 SSDs (compatible with 2230, 2242, 2260, 2280 sizes, supporting PCIe Gen3), enabling rapid data transfer and high-speed system booting.
de: Der LAFVIN M.2 NVMe SSD Adapter ist eine NVMe M.2 SSD PCIe Peripheriekarte (PIP), die speziell für den Raspberry Pi 5 entwickelt wurde. Er nutzt die PCIe-Schnittstelle des Pi 5, um NVMe M.2 SSDs (kompatibel mit den Größen 2230, 2242, 2260, 2280, die PCIe Gen3 unterstützen) anzuschließen und ermöglicht so eine schnelle Datenübertragung und ein schnelles Booten des Systems.
es: El LAFVIN M.2 NVMe SSD Adapter es una placa periférica (PIP) NVMe M.2 SSD PCIe diseñada específicamente para la Raspberry Pi 5. Utiliza la interfaz PCIe de la Pi 5 para conectar SSD M.2 NVMe (compatible con los tamaños 2230, 2242, 2260, 2280, compatible con PCIe Gen3), lo que permite una rápida transferencia de datos y el arranque del sistema a alta velocidad.
fr: L'adaptateur SSD M.2 NVMe de LAFVIN est une carte périphérique PCIe SSD M.2 NVMe (PIP) conçue spécifiquement pour le Raspberry Pi 5. Il utilise l'interface PCIe du Pi 5 pour connecter des disques SSD NVMe M.2 (compatibles avec les tailles 2230, 2242, 2260, 2280, prenant en charge PCIe Gen3), permettant un transfert de données rapide et un démarrage du système à grande vitesse.
it: LAFVIN M.2 NVMe SSD Adapter è una scheda periferica NVMe M.2 SSD PCIe (PIP) progettata specificamente per il Raspberry Pi 5. Utilizza l'interfaccia PCIe del Pi 5 per collegare le unità SSD NVMe M.2 (compatibili con i formati 2230, 2242, 2260, 2280, che supportano PCIe Gen3), consentendo un rapido trasferimento dei dati e un avvio del sistema ad alta velocità.
ja: LAFVIN M.2 NVMe SSDアダプタは、Raspberry Pi 5専用に設計されたNVMe M.2 SSD PCIeペリフェラルボード（PIP）です。Pi 5のPCIeインターフェイスを利用してNVMe M.2 SSD（2230、2242、2260、2280サイズと互換性があり、PCIe Gen3をサポート）を接続し、高速データ転送と高速システム起動を可能にします。
zh_cn: LAFVIN M.2 NVMe SSD 适配器是专为 Raspberry Pi 5 设计的 NVMe M.2 SSD PCIe 外围板 (PIP)。它利用 Pi 5 的 PCIe 接口连接 NVMe M.2 SSD（兼容 2230、2242、2260、2280 尺寸，支持 PCIe Gen3），实现快速数据传输和高速系统启动。

source: The LAFVIN M.2 NVMe SSD Adapter board conforms to the standard Raspberry Pi HAT dimensions and supports the four common NVMe SSD sizes: 2230, 2242, 2260, and 2280. The kit includes SSD mounting screws, allowing users to easily install different SSD sizes as needed.
de: Das LAFVIN M.2 NVMe SSD Adapter Board entspricht den Standard-Raspberry Pi HAT Abmessungen und unterstützt die vier gängigen NVMe SSD Größen: 2230, 2242, 2260 und 2280. Das Kit enthält SSD-Montageschrauben, so dass Benutzer leicht verschiedene SSD-Größen nach Bedarf installieren können.
es: La placa LAFVIN M.2 NVMe SSD Adapter se ajusta a las dimensiones estándar Raspberry Pi HAT y admite los cuatro tamaños de SSD NVMe más comunes: 2230, 2242, 2260 y 2280. El kit incluye tornillos de montaje SSD, lo que permite a los usuarios instalar fácilmente diferentes tamaños de SSD según sea necesario.
fr: La carte LAFVIN M.2 NVMe SSD Adapter est conforme aux dimensions standard du Raspberry Pi HAT et prend en charge les quatre tailles courantes de SSD NVMe : 2230, 2242, 2260 et 2280. Le kit comprend des vis de montage pour SSD, permettant aux utilisateurs d'installer facilement différentes tailles de SSD selon leurs besoins.
it: La scheda LAFVIN M.2 NVMe SSD Adapter è conforme alle dimensioni standard di Raspberry Pi HAT e supporta le quattro dimensioni comuni di SSD NVMe: 2230, 2242, 2260 e 2280. Il kit comprende viti di montaggio per SSD, che consentono agli utenti di installare facilmente SSD di dimensioni diverse a seconda delle necessità.
ja: LAFVIN M.2 NVMe SSDアダプタボードは、標準的なRaspberry Pi HATの寸法に準拠しており、4つの一般的なNVMe SSDサイズ（2230、2242、2260、2280）をサポートしています。キットにはSSD取り付けネジが含まれており、ユーザーは必要に応じて異なるサイズのSSDを簡単に取り付けることができます。
zh_cn: LAFVIN M.2 NVMe 固态硬盘适配器板符合标准 Raspberry Pi HAT 尺寸，支持四种常见的 NVMe 固态硬盘尺寸：2230、2242、2260 和 2280。该套件包括固态硬盘安装螺丝，用户可以根据需要轻松安装不同尺寸的固态硬盘。

source: Features
de: Eigenschaften
es: Características
fr: Caractéristiques
it: Caratteristiche
ja: 特徴
zh_cn: 功能

source: **Designed for Raspberry Pi 5:** Perfectly tailored for the latest Raspberry Pi 5 single-board computer.
de: **Gestaltet für Raspberry Pi 5:** Perfekt zugeschnitten für den neuesten Raspberry Pi 5 Einplatinencomputer.
es: **Diseñado para Raspberry Pi 5:** Perfectamente adaptado para el último ordenador de placa única Raspberry Pi 5.
fr: **Conçu pour Raspberry Pi 5:** Parfaitement adapté au dernier ordinateur monocarte Raspberry Pi 5.
it: **Progettato per Raspberry Pi 5:** Perfettamente adattato al più recente computer a scheda singola Raspberry Pi 5.
ja: **最新のシングルボードコンピューターRaspberry Pi 5用に設計されています。
zh_cn: **专为 Raspberry Pi 5 设计：** 为最新的 Raspberry Pi 5 单板计算机完美定制。

source: **NVMe Support:** Supports installation of M Key and B+M Key M.2 NVMe SSDs in 2230, 2242, 2260, and 2280 formats. Includes custom CNC SSD mounting screws, no soldering required.
de: **NVMe-Unterstützung:** Unterstützt die Installation von M Key und B+M Key M.2 NVMe SSDs in den Formaten 2230, 2242, 2260 und 2280. Inklusive kundenspezifischer CNC SSD-Montageschrauben, kein Löten erforderlich.
es: **Compatibilidad con NVMe:** Admite la instalación de SSD M Key y B+M Key M.2 NVMe en formatos 2230, 2242, 2260 y 2280. Incluye tornillos de montaje de SSD CNC personalizados, no es necesario soldar.
fr: **Support NVMe:** Prend en charge l'installation des disques SSD M Key et B+M Key M.2 NVMe aux formats 2230, 2242, 2260 et 2280. Comprend des vis de montage SSD CNC personnalisées, aucune soudure n'est nécessaire.
it: **Supporta l'installazione di SSD M Key e B+M Key M.2 NVMe nei formati 2230, 2242, 2260 e 2280. Include viti di montaggio SSD CNC personalizzate, senza necessità di saldature.
ja: **NVMe対応：** 2230、2242、2260、2280フォーマットのM KeyおよびB+M Key M.2 NVMe SSDの取り付けをサポート。ハンダ付け不要のカスタムCNC SSD取り付けネジ付き。
zh_cn: **NVMe 支持：** 支持安装 2230、2242、2260 和 2280 格式的 M Key 和 B+M Key M.2 NVMe 固态硬盘。包括定制的 CNC SSD 安装螺钉，无需焊接。

source: **PCIe Support:** Supports PCIe x1 interface, compatible with both Gen2 and Gen3 standards.
de: **PCIe-Unterstützung:** Unterstützt die PCIe x1-Schnittstelle, kompatibel mit den Standards Gen2 und Gen3.
es: **Compatible con PCIe:** Admite la interfaz PCIe x1, compatible con los estándares Gen2 y Gen3.
fr: **Prise en charge PCIe:** Prise en charge de l'interface PCIe x1, compatible avec les normes Gen2 et Gen3.
it: **Supporto PCIe:** Supporta l'interfaccia PCIe x1, compatibile con gli standard Gen2 e Gen3.
ja: **PCIe対応:** PCIe x1インターフェイスをサポートし、Gen2およびGen3規格の両方に対応。
zh_cn: **支持 PCIe：** 支持 PCIe x1 接口，兼容 Gen2 和 Gen3 标准。

source: **Optimized Cooling:** On-board ventilation holes facilitate airflow, enhancing heat dissipation.
de: **Optimierte Kühlung:** On-Board-Belüftungsöffnungen erleichtern den Luftstrom und verbessern die Wärmeableitung.
es: **Refrigeración optimizada:** Los orificios de ventilación integrados facilitan el flujo de aire, mejorando la disipación del calor.
fr: **Refroidissement optimisé:** Les trous de ventilation intégrés facilitent la circulation de l'air et améliorent la dissipation de la chaleur.
it: **Raffreddamento ottimizzato:** I fori di ventilazione a bordo facilitano il flusso d'aria, migliorando la dissipazione del calore.
ja: **最適化された冷却：**オンボードの通気孔は、熱放散を強化し、空気の流れを容易にします。
zh_cn: **优化散热：** 板载通风孔可促进空气流通，增强散热效果。

source: **Camera/Display FPC Cutouts:** Openings are reserved on the PCB to allow routing for two display or camera FPC cables.
de: **Kamera-/Display-FPC-Ausschnitte:** Auf der Platine sind Öffnungen für die Verlegung von zwei Display- oder Kamera-FPC-Kabeln vorgesehen.
es: **Recortes para FPC de cámara/pantalla:** Se reservan huecos en la placa de circuito impreso para permitir el paso de dos cables de FPC de cámara o pantalla.
fr: **Des ouvertures sont réservées sur le circuit imprimé pour permettre le passage de deux câbles FPC d'affichage ou de caméra.
it: **Tagli per telecamera/display FPC:** Sulla scheda PCB sono presenti aperture per consentire il passaggio di due cavi FPC del display o della telecamera.
ja: **カメラ/ディスプレイFPCカットアウト:** 2つのディスプレイまたはカメラFPCケーブルの配線を可能にするため、PCB上に開口部が確保されています。
zh_cn: **摄像头/显示器 FPC 开孔：** PCB 上预留了开口，以便为两根显示器或摄像头 FPC 电缆布线。

source: **Gold-Plated PCB:** Manufactured using an immersion gold process for superior electrical performance and durability.
de: **Vergoldete Leiterplatte:** Hergestellt mit einem Tauchgoldverfahren für hervorragende elektrische Leistung und Haltbarkeit.
es: **Placa de circuito impreso chapada en oro:** Fabricada mediante un proceso de inmersión en oro para obtener un rendimiento eléctrico y una durabilidad superiores.
fr: **PCB plaqué or:** Fabriqué à l'aide d'un procédé d'immersion dans l'or pour des performances électriques et une durabilité supérieures.
it: **PCB placcato in oro:** Prodotto con un processo di immersione in oro per garantire prestazioni elettriche e durata superiori.
ja: **金メッキPCB:**優れた電気的性能と耐久性のために無電解金プロセスを使用して製造された。
zh_cn: **镀金印刷电路板：** 采用浸金工艺制造，具有卓越的电气性能和耐用性。

source: **Ultra-Short PCIe Traces:** Optimized short PCIe signal routing ensures more reliable and faster transmission, fully meeting PCIe Gen3 signal requirements.
de: **Ultrakurze PCIe-Leitungen:** Optimierte kurze PCIe-Signalführung sorgt für eine zuverlässigere und schnellere Übertragung und erfüllt die PCIe Gen3-Signalanforderungen vollständig.
es: **Trazados de señal PCIe ultracortos:** El trazado optimizado de la señal PCIe corta garantiza una transmisión más fiable y rápida, cumpliendo plenamente los requisitos de la señal PCIe Gen3.
fr: **Traces PCIe ultra-courtes:** Le routage optimisé des signaux PCIe courts garantit une transmission plus fiable et plus rapide, répondant pleinement aux exigences des signaux PCIe Gen3.
it: **Tracce PCIe ultracorte:** L'instradamento ottimizzato del segnale PCIe corto garantisce una trasmissione più affidabile e veloce, soddisfacendo pienamente i requisiti del segnale PCIe Gen3.
ja: **超短PCIeトレース:**最適化された短いPCIe信号ルーティングは、PCIe Gen3信号要件を完全に満たし、より信頼性が高く、より高速な伝送を保証します。
zh_cn: **超短 PCIe 路由：** 优化的 PCIe 短信号路由可确保更可靠、更快速的传输，完全满足 PCIe Gen3 信号要求。

source: **LED Indicator:** Features an onboard LED indicator ("ACT") for M.2 SSD activity status.
de: **LED-Anzeige:** Verfügt über eine integrierte LED-Anzeige ("ACT") für den Aktivitätsstatus der M.2 SSD.
es: **Indicador LED:** Cuenta con un indicador LED integrado ("ACT") para el estado de actividad M.2 SSD.
fr: **Indicateur LED:** Comprend un indicateur LED intégré (ACT) pour le statut de l'activité du SSD M.2.
it: **Indicatore LED: ** Dispone di un indicatore LED integrato (ACT) per lo stato di attività dell'unità SSD M.2.
ja: **LEDインジケーター:** M.2 SSDのアクティビティステータスを表示するオンボードLEDインジケーター(「ACT」)を搭載。
zh_cn: **LED 指示灯：** 板载 LED 指示灯（“ACT”）可显示 M.2 固态硬盘的活动状态。

source: **M.2 Standard Power System:** Integrates an efficient voltage regulator providing up to 3A for the 3.3V power rail, compliant with M.2 (NGFF) power specifications.
de: **M.2-Standard-Stromversorgungssystem:** Integriert einen effizienten Spannungsregler, der bis zu 3 A für die 3,3-V-Stromschiene liefert und den M.2 (NGFF)-Stromversorgungsspezifikationen entspricht.
es: **Sistema de alimentación estándar M.2:** Integra un eficiente regulador de voltaje que proporciona hasta 3 A para el carril de alimentación de 3,3 V, conforme a las especificaciones de alimentación M.2 (NGFF).
fr: **Système d'alimentation standard M.2:** Intègre un régulateur de tension efficace fournissant jusqu'à 3A pour le rail d'alimentation 3.3V, conforme aux spécifications d'alimentation M.2 (NGFF).
it: **Sistema di alimentazione standard M.2:** Integra un efficiente regolatore di tensione che fornisce fino a 3A per il rail di alimentazione da 3,3V, conforme alle specifiche di alimentazione M.2 (NGFF).
ja: **M.2標準電源システム：** M.2（NGFF）電源仕様に準拠し、3.3V電源レールに最大3Aを供給する効率的な電圧レギュレーターを統合。
zh_cn: **M.2 标准电源系统：** 集成了一个高效稳压器，可为 3.3V 电源轨提供高达 3A 的电流，符合 M.2 (NGFF) 电源规格。

source: **All Necessary Accessories Included:** The kit contains an FPC PCIe ribbon cable, M2 and M2.5 screws, standoffs, SSD mounting standoffs, and an M.2 SSD heatsink kit including a heatsink and thermal pad.
de: **Alles notwendige Zubehör enthalten:** Das Kit enthält ein FPC-PCIe-Flachbandkabel, M2- und M2,5-Schrauben, Standoffs, SSD-Montage-Standoffs und ein M.2-SSD-Kühlkörper-Kit mit einem Kühlkörper und einem Wärmeleitpad.
es: **Todos los accesorios necesarios incluidos:** El kit contiene un cable de cinta FPC PCIe, tornillos M2 y M2.5, separadores, separadores de montaje SSD y un kit de disipador térmico SSD M.2 que incluye un disipador térmico y una almohadilla térmica.
fr: **Tous les accessoires nécessaires sont inclus:** Le kit contient un câble ruban PCIe FPC, des vis M2 et M2,5, des entretoises, des entretoises de montage SSD et un kit de dissipation thermique SSD M.2 comprenant un dissipateur et un coussin thermique.
it: **Il kit contiene un cavo a nastro FPC PCIe, viti M2 e M2,5, distanziatori, distanziatori per il montaggio dell'SSD e un kit di dissipatori per SSD M.2 che include un dissipatore e un pad termico.
ja: **必要なアクセサリーをすべて同梱:** このキットには、FPC PCIeリボンケーブル、M2およびM2.5ネジ、スタンドオフ、SSDマウント用スタンドオフ、ヒートシンクとサーマルパッドを含むM.2 SSDヒートシンクキットが含まれています。
zh_cn: **包含的所有必要配件：** 套件包含一条 FPC PCIe 带状电缆、M2 和 M2.5 螺钉、支座、固态硬盘安装支座以及一个 M.2 固态硬盘散热套件（包括散热片和散热垫）。

source: Included accessories in the kit
de: Im Bausatz enthaltenes Zubehör
es: Accesorios incluidos en el kit
fr: Accessoires inclus dans le kit
it: Accessori inclusi nel kit
ja: キットに含まれるアクセサリー
zh_cn: 套件中包含的配件

source: Application Scenarios
de: Anwendungsszenarien
es: Escenarios de aplicación
fr: Scénarios d'application
it: Scenari di applicazione
ja: アプリケーション・シナリオ
zh_cn: 应用场景

source: **Expanded Storage:** Provide your Raspberry Pi with high-speed, large-capacity additional storage space.
de: **Erweiterter Speicher:** Bieten Sie Ihrem Raspberry Pi zusätzlichen Speicherplatz mit hoher Geschwindigkeit und großer Kapazität.
es: **Almacenamiento ampliado:** Proporcione a su Raspberry Pi espacio de almacenamiento adicional de gran capacidad y alta velocidad.
fr: **Stockage étendu:** Fournissez à votre Raspberry Pi un espace de stockage supplémentaire à grande vitesse et de grande capacité.
it: **Magazzino ampliato:** Fornisce al vostro Raspberry Pi uno spazio di archiviazione aggiuntivo ad alta velocità e di grande capacità.
ja: **拡張ストレージ：**高速、大容量の追加ストレージスペースをRaspberry Piに提供します。
zh_cn: **扩展存储：** 为你的 Raspberry Pi 提供高速、大容量的额外存储空间。

source: **System Boot Disk:** Use the SSD as the primary system disk for your Raspberry Pi 5 to experience ultra-fast boot times and responsiveness.
de: **System-Boot-Diskette:** Verwenden Sie die SSD als primäre Systemdiskette für Ihren Raspberry Pi 5, um ultraschnelle Boot-Zeiten und Reaktionsfähigkeit zu erleben.
es: **Utiliza el SSD como disco principal del sistema para tu Raspberry Pi 5 y disfruta de tiempos de arranque y capacidad de respuesta ultrarrápidos.
fr: **Utilisez le SSD comme disque système principal pour votre Raspberry Pi 5 afin de bénéficier de temps de démarrage et d'une réactivité ultra-rapides.
it: **Utilizzare l'unità SSD come disco di sistema primario per il Raspberry Pi 5 per sperimentare tempi di avvio e reattività ultraveloci.
ja: **システム起動ディスク:** Raspberry Pi 5のプライマリシステムディスクとしてSSDを使用すると、超高速起動時間と応答性を体験できます。
zh_cn: **系统启动磁盘：** 使用固态硬盘作为 Raspberry Pi 5 的主系统磁盘，体验超快的启动时间和响应速度。

source: The kit includes all necessary accessories **except** for the Raspberry Pi 5 board, SD card, and M.2 NVMe SSD itself.
de: Das Kit enthält alles notwendige Zubehör **außer** dem Raspberry Pi 5 Board, der SD-Karte und der M.2 NVMe SSD selbst.
es: El kit incluye todos los accesorios necesarios **excepto** la placa Raspberry Pi 5, la tarjeta SD y el propio SSD M.2 NVMe.
fr: Le kit comprend tous les accessoires nécessaires **à l'exception** de la carte Raspberry Pi 5, de la carte SD et du SSD M.2 NVMe lui-même.
it: Il kit comprende tutti gli accessori necessari **ad eccezione** della scheda Raspberry Pi 5, della scheda SD e dell'unità SSD M.2 NVMe.
ja: キットには、Raspberry Pi 5ボード、SDカード、M.2 NVMe SSD本体を除く**必要なアクセサリーがすべて含まれています。
zh_cn: 除 Raspberry Pi 5 电路板、SD 卡和 M.2 NVMe 固态硬盘本身外，该套件还包括所有必要的配件。
