Repository: lafvintech/LAFVIN-M.2-NVMe-SSD-Adapter-For-RPI5
Catalog: docs/locales/*/LC_MESSAGES/Tutorial/1.hardware_setup.po
Languages: de, es, fr, it, ja, zh_cn

source: 1. Hardware Setup
de: 1. Hardware-Einrichtung
es: 1. Configuración del hardware
fr: 1. Configuration du matériel
it: 1. Configurazione dell'hardware
ja: 1.ハードウェアのセットアップ
zh_cn: 1.硬件设置

source: This section guides you through the hardware assembly process for the M.2 NVMe SSD adapter.
de: Dieser Abschnitt führt Sie durch den Hardware-Montageprozess für den M.2 NVMe-SSD-Adapter.
es: Esta sección le guía a través del proceso de ensamblaje del hardware para el adaptador SSD M.2 NVMe.
fr: Cette section vous guide dans le processus d'assemblage du matériel de l'adaptateur SSD M.2 NVMe.
it: Questa sezione illustra il processo di assemblaggio dell'hardware dell'adattatore SSD M.2 NVMe.
ja: このセクションでは、M.2 NVMe SSD アダプターのハードウェア組み立て手順を説明します。
zh_cn: 本节将指导您完成 M.2 NVMe 固态硬盘适配器的硬件组装过程。

source: You can refer to the video tutorial below. Please follow the steps in the video to install your M.2 NVMe SSD adapter:
de: Sie können sich das unten stehende Video-Tutorial ansehen. Bitte folgen Sie den Schritten im Video, um Ihren M.2 NVMe SSD-Adapter zu installieren:
es: Puede consultar el siguiente tutorial en vídeo. Siga los pasos del vídeo para instalar el adaptador SSD M.2 NVMe:
fr: Vous pouvez vous référer au tutoriel vidéo ci-dessous. Veuillez suivre les étapes de la vidéo pour installer votre adaptateur SSD M.2 NVMe :
it: È possibile consultare l'esercitazione video riportata di seguito. Seguire i passaggi del video per installare l'adattatore SSD M.2 NVMe:
ja: 以下のビデオチュートリアルをご参照ください。ビデオの手順に従って、M.2 NVMe SSD アダプターをインストールしてください：
zh_cn: 您可以参考下面的视频教程。请按照视频中的步骤安装 M.2 NVMe 固态硬盘适配器：

source: Install VNC Viewer Software
de: VNC-Viewer-Software installieren
fr: Installer le logiciel VNC Viewer
it: Installare il software VNC Viewer
ja: VNCビューアソフトウェアをインストールする

source: Please visit the official RealVNC website below to download and install the VNC Viewer client according to your operating system:
de: Bitte besuchen Sie die offizielle RealVNC-Website unten, um den VNC-Viewer-Client für Ihr Betriebssystem herunterzuladen und zu installieren:
es: Visite el sitio web oficial de RealVNC para descargar e instalar el cliente VNC Viewer según su sistema operativo:
fr: Veuillez visiter le site officiel de RealVNC ci-dessous pour télécharger et installer le client VNC Viewer en fonction de votre système d'exploitation :
it: Visitare il sito ufficiale di RealVNC per scaricare e installare il client VNC Viewer in base al proprio sistema operativo:
ja: 以下のRealVNC公式サイトから、お使いのOSに合ったVNC Viewerクライアントをダウンロードし、インストールしてください：
zh_cn: 请访问以下 RealVNC 官方网站，根据操作系统下载并安装 VNC Viewer 客户端：

source: `Download VNC Viewer <https://www.realvnc.com/en/connect/download/viewer/>`_
de: VNC-Viewer herunterladen <https://www.realvnc.com/en/connect/download/viewer/>`_
es: `Descargar VNC Viewer <https://www.realvnc.com/en/connect/download/viewer/>`_
fr: `Télécharger la visionneuse VNC <https://www.realvnc.com/en/connect/download/viewer/>`_
it: Scaricare il visualizzatore VNC <https://www.realvnc.com/en/connect/download/viewer/>`_
ja: VNC Viewerのダウンロード <https://www.realvnc.com/en/connect/download/viewer/>`_
zh_cn: 下载 VNC 查看器 <https://www.realvnc.com/en/connect/download/viewer/>`_

source: VNC Viewer Download Page
de: VNC-Viewer Download-Seite
es: Página de descarga de VNC Viewer
fr: Page de téléchargement de VNC Viewer
it: Pagina di download del visualizzatore VNC
ja: VNC Viewer ダウンロードページ
zh_cn: VNC Viewer 下载页面

source: After downloading, follow the installation wizard to complete the setup. Then, launch VNC Viewer, enter your Raspberry Pi's IP address, and click the connect button.
de: Nach dem Herunterladen folgen Sie dem Installationsassistenten, um die Einrichtung abzuschließen. Starten Sie dann VNC Viewer, geben Sie die IP-Adresse Ihres Raspberry Pi ein und klicken Sie auf die Schaltfläche Verbinden.
es: Después de la descarga, sigue el asistente de instalación para completar la configuración. A continuación, inicia VNC Viewer, introduce la dirección IP de tu Raspberry Pi y haz clic en el botón de conexión.
fr: Après le téléchargement, suivez l'assistant d'installation pour terminer la configuration. Ensuite, lancez VNC Viewer, entrez l'adresse IP de votre Raspberry Pi et cliquez sur le bouton de connexion.
it: Dopo il download, seguire l'installazione guidata per completare la configurazione. Quindi, avviare VNC Viewer, inserire l'indirizzo IP del Raspberry Pi e fare clic sul pulsante di connessione.
ja: ダウンロード後、インストールウィザードに従ってセットアップを完了します。その後、VNC Viewerを起動し、Raspberry PiのIPアドレスを入力し、接続ボタンをクリックします。
zh_cn: 下载后，按照安装向导完成设置。然后，启动 VNC Viewer，输入 Raspberry Pi 的 IP 地址，点击连接按钮。

source: VNC Viewer Connection Window
de: VNC-Viewer-Verbindungsfenster
es: Ventana de conexión de VNC Viewer
fr: Fenêtre de connexion du visualiseur VNC
it: Finestra di connessione del visualizzatore VNC
ja: VNCビューア接続画面
zh_cn: VNC 浏览器连接窗口

source: You need to know the IP address of the Raspberry PI to connect through VNC. Usually, you can use the 'ping -4 raspberrypi.local' command in the command line or terminal of your computer, or find the IP address by checking the list of connected devices on your router. Also, please ensure that you have enabled the VNC server on the Raspberry PI (this can be done by running 'sudo raspi-config' 'and then selecting Interface Options -> VNC -> Yes).
de: Sie müssen die IP-Adresse des Raspberry PI kennen, um eine Verbindung über VNC herzustellen. Normalerweise können Sie den Befehl "ping -4 raspberrypi.local" in der Kommandozeile oder im Terminal Ihres Computers verwenden oder die IP-Adresse durch Überprüfen der Liste der angeschlossenen Geräte auf Ihrem Router ermitteln. Vergewissern Sie sich auch, dass Sie den VNC-Server auf dem Raspberry PI aktiviert haben (dazu führen Sie 'sudo raspi-config' aus und wählen dann Interface Options -> VNC -> Yes).
fr: Vous devez connaître l'adresse IP du Raspberry PI pour vous connecter via VNC. En général, vous pouvez utiliser la commande 'ping -4 raspberrypi.local' dans la ligne de commande ou le terminal de votre ordinateur, ou trouver l'adresse IP en vérifiant la liste des périphériques connectés sur votre routeur. Assurez-vous également que vous avez activé le serveur VNC sur le Raspberry PI (vous pouvez le faire en exécutant 'sudo raspi-config' et en sélectionnant Options d'interface -> VNC -> Oui).
it: Per collegarsi tramite VNC è necessario conoscere l'indirizzo IP del Raspberry PI. Di solito, è possibile utilizzare il comando "ping -4 raspberrypi.local" nella riga di comando o nel terminale del computer, oppure trovare l'indirizzo IP controllando l'elenco dei dispositivi connessi sul router. Inoltre, assicurarsi di aver abilitato il server VNC sul Raspberry PI (è possibile farlo eseguendo 'sudo raspi-config' e selezionando Opzioni interfaccia -> VNC -> Sì).
ja: VNCで接続するには、Raspberry PIのIPアドレスを知っている必要があります。通常、コンピュータのコマンドラインまたはターミナルで 'ping -4 raspberrypi.local' コマンドを使用するか、ルーターの接続デバイスリストを確認してIPアドレスを見つけることができます。また、Raspberry PIでVNCサーバーが有効になっていることを確認してください（これは'sudo raspi-config'を実行し、Interface Options -> VNC -> Yesを選択することで行えます）。

source: 2. Install VNC Viewer Software
es: 2. Instalar el software VNC Viewer
zh_cn: 2.安装 VNC 查看器软件

source: You need to know the IP address of the Raspberry PI to connect through VNC. Usually, you can use the 'ping-4 raspberrypi.local' command in the command line or terminal of your computer, or find the IP address by checking the list of connected devices on your router. Also, please ensure that you have enabled the VNC server on the Raspberry PI (this can be done by running 'sudo raspi-config' 'and then selecting Interface Options -> VNC -> Yes).
es: Necesitas conocer la dirección IP de la Raspberry PI para conectarte a través de VNC. Normalmente, puedes utilizar el comando 'ping-4 raspberrypi.local' en la línea de comandos o terminal de tu ordenador, o encontrar la dirección IP comprobando la lista de dispositivos conectados en tu router. Además, por favor, asegúrese de que ha habilitado el servidor VNC en la Raspberry PI (esto se puede hacer ejecutando 'sudo raspi-config' 'y luego seleccionando Opciones de interfaz -> VNC -> Sí).
zh_cn: 您需要知道 Raspberry PI 的 IP 地址才能通过 VNC 进行连接。通常，你可以在计算机的命令行或终端中使用 "ping-4 raspberrypi.local "命令，或者通过查看路由器上的连接设备列表来查找 IP 地址。此外，请确保已启用 Raspberry PI 上的 VNC 服务器（可通过运行 "sudo raspi-config"，然后选择 "接口选项" -> "VNC" -> "是"）。
