Repository: lafvintech/LAFVIN-M.2-NVMe-SSD-Adapter-For-RPI5
Catalog: docs/locales/*/LC_MESSAGES/Tutorial/2.ssd_*_storage.po
Languages: de, es, fr, it, ja, zh_cn

source: 2. Using SSD as Expanded Storage (SD Card + SSD)
de: 2. Verwendung von SSD als erweiterter Speicher (SD-Karte + SSD)
es: 2. Uso de SSD como almacenamiento ampliado (tarjeta SD + SSD)
fr: 2. Utilisation d'un disque SSD comme espace de stockage étendu (carte SD + disque SSD)
it: 2. Utilizzo dell'SSD come memoria espansa (scheda SD + SSD)
ja: 2.SSDを拡張ストレージとして使用する（SDカード＋SSD）
zh_cn: 2.使用固态硬盘作为扩展存储（SD 卡 + 固态硬盘）

source: This chapter will guide you on how to configure an M.2 NVMe SSD as expanded storage for your Raspberry Pi 5 (meaning the system still runs on the SD card, and the SSD is used for storing data).
de: In diesem Kapitel erfahren Sie, wie Sie eine M.2 NVMe-SSD als erweiterten Speicher für Ihren Raspberry Pi 5 konfigurieren (d. h. das System läuft weiterhin auf der SD-Karte, und die SSD wird zum Speichern von Daten verwendet).
es: Este capítulo le guiará sobre cómo configurar un SSD M.2 NVMe como almacenamiento ampliado para su Raspberry Pi 5 (lo que significa que el sistema todavía se ejecuta en la tarjeta SD, y el SSD se utiliza para almacenar datos).
fr: Ce chapitre vous explique comment configurer un disque SSD M.2 NVMe en tant que stockage étendu pour votre Raspberry Pi 5 (ce qui signifie que le système fonctionne toujours sur la carte SD et que le disque SSD est utilisé pour stocker les données).
it: Questo capitolo vi guiderà su come configurare un'unità SSD M.2 NVMe come memoria espansa per il vostro Raspberry Pi 5 (il che significa che il sistema continua a funzionare sulla scheda SD e l'unità SSD viene utilizzata per memorizzare i dati).
ja: この章では、M.2 NVMe SSD を Raspberry Pi 5 の拡張ストレージとして設定する方法を説明します（システムは引き続き SD カードで実行し、SSD はデータの保存に使用するという意味です）。
zh_cn: 本章将指导你如何配置 M.2 NVMe 固态硬盘作为 Raspberry Pi 5 的扩展存储（即系统仍在 SD 卡上运行，固态硬盘用于存储数据）。

source: First, log in to your Raspberry Pi 5 system via SSH or by directly connecting a keyboard and monitor.
de: Melden Sie sich zunächst über SSH oder durch den direkten Anschluss einer Tastatur und eines Monitors an Ihrem Raspberry Pi 5-System an.
es: En primer lugar, inicia sesión en tu sistema Raspberry Pi 5 a través de SSH o conectando directamente un teclado y un monitor.
fr: Tout d'abord, connectez-vous à votre système Raspberry Pi 5 via SSH ou en connectant directement un clavier et un moniteur.
it: Per prima cosa, accedere al sistema Raspberry Pi 5 tramite SSH o collegando direttamente una tastiera e un monitor.
ja: まず、SSHかキーボードとモニターを直接接続してRaspberry Pi 5にログインします。
zh_cn: 首先，通过 SSH 或直接连接键盘和显示器登录 Raspberry Pi 5 系统。

source: **Step 1: Modify Boot Configuration**
de: **Schritt 1: Ändern der Boot-Konfiguration**
es: **Paso 1: Modificar la configuración de arranque**
fr: **Étape 1 : Modifier la configuration de l'amorçage**
it: **Fase 1: modifica della configurazione di avvio**
ja: **ステップ1：ブート設定の変更**」。
zh_cn: **第 1 步：修改启动配置**

source: Edit the ``/boot/firmware/config.txt`` file. Using the ``nano`` editor is recommended:
de: Bearbeiten Sie die Datei ``/boot/firmware/config.txt``. Es wird empfohlen, den ``nano``-Editor zu verwenden:
es: Edita el archivo ``/boot/firmware/config.txt``. Se recomienda usar el editor ``nano``:
fr: Editez le fichier ``/boot/firmware/config.txt``. L'utilisation de l'éditeur ``nano`` est recommandée :
it: Modificare il file ``/boot/firmware/config.txt``. Si consiglia di utilizzare l'editor ``nano``:
ja: boot/firmware/config.txt`` ファイルを編集します。nano`` エディターの使用を推奨します：
zh_cn: 编辑 ``/boot/firmware/config.txt`` 文件。建议使用 ``nano`` 编辑器：

source: Add the following two lines at the end of the file:
de: Fügen Sie die folgenden zwei Zeilen am Ende der Datei ein:
es: Añada las dos líneas siguientes al final del fichero:
fr: Ajoutez les deux lignes suivantes à la fin du fichier :
it: Aggiungete le due righe seguenti alla fine del file:
ja: ファイルの最後に以下の2行を追加する：
zh_cn: 在文件末尾添加以下两行：

source: Press ``Ctrl+X``, then ``Y``, and finally ``Enter`` to save and exit the editor.
de: Drücken Sie ``Strg+X``, dann ``Y`` und schließlich ``Eingabe``, um zu speichern und den Editor zu verlassen.
es: Pulsa ``Ctrl+X``, luego ``Y`` y, por último, ``Enter`` para guardar y salir del editor.
fr: Appuyez sur ``Ctrl+X``, puis sur ``Y``, et enfin sur ``Enter`` pour sauvegarder et quitter l'éditeur.
it: Premere ``Ctrl+X``, poi ``Y`` e infine ``Invio`` per salvare e uscire dall'editor.
ja: Ctrl+X`` を押し、次に ``Y`` を押し、最後に ``Enter`` を押して保存し、エディタを終了します。
zh_cn: 按``Ctrl+X``，然后按``Y``，最后按``Enter`保存并退出编辑器。

source: **Step 2: Install Hardware**
de: **Schritt 2: Hardware installieren**
es: **Paso 2: Instalar el hardware**
fr: **Étape 2 : Installation du matériel**
it: **Fase 2: installazione dell'hardware**
ja: **ステップ2：ハードウェアの取り付け
zh_cn: **第 2 步：安装硬件**

source: Power off the Raspberry Pi 5.
de: Schalten Sie den Raspberry Pi 5 aus.
es: Apague la Raspberry Pi 5.
fr: Éteignez le Raspberry Pi 5.
it: Spegnere il Raspberry Pi 5.
ja: Raspberry Pi 5の電源を切ります。
zh_cn: 关闭 Raspberry Pi 5 的电源。

source: Following the instructions for your M.2 adapter, correctly install your NVMe SSD onto the M.2 adapter.
de: Befolgen Sie die Anweisungen für Ihren M.2-Adapter und installieren Sie Ihre NVMe-SSD korrekt auf dem M.2-Adapter.
es: Siguiendo las instrucciones de su adaptador M.2, instale correctamente su SSD NVMe en el adaptador M.2.
fr: En suivant les instructions de votre adaptateur M.2, installez correctement votre SSD NVMe sur l'adaptateur M.2.
it: Seguendo le istruzioni per l'adattatore M.2, installare correttamente l'unità SSD NVMe sull'adattatore M.2.
ja: M.2アダプタの説明書に従って、NVMe SSDをM.2アダプタに正しく取り付けます。
zh_cn: 按照 M.2 适配器的说明，将 NVMe 固态硬盘正确安装到 M.2 适配器上。

source: **Step 3: Check SSD Recognition**
de: **Schritt 3: SSD-Erkennung prüfen**
es: **Paso 3: Comprobar el reconocimiento de SSD**
fr: **Étape 3 : Vérifier la reconnaissance du disque dur SSD**
it: **Fase 3: Controllo del riconoscimento dell'SSD**
ja: **ステップ3: SSDの認識を確認する**。
zh_cn: **第 3 步：检查固态硬盘识别**

source: Reconnect the power and boot up the Raspberry Pi 5.
de: Schließen Sie die Stromversorgung wieder an und starten Sie den Raspberry Pi 5.
es: Vuelva a conectar la alimentación y arranque la Raspberry Pi 5.
fr: Rebranchez l'alimentation et démarrez le Raspberry Pi 5.
it: Ricollegare l'alimentazione e avviare il Raspberry Pi 5.
ja: 電源を再接続し、Raspberry Pi 5を起動します。
zh_cn: 重新连接电源并启动 Raspberry Pi 5。

source: Open a terminal and execute the following commands to check the PCI-E devices and block device list, confirming if your SSD is recognized by the system:
de: Öffnen Sie ein Terminal und führen Sie die folgenden Befehle aus, um die PCI-E-Geräte und die Block-Geräteliste zu überprüfen und festzustellen, ob Ihre SSD vom System erkannt wird:
es: Abra un terminal y ejecute los siguientes comandos para comprobar los dispositivos PCI-E y la lista de dispositivos de bloque, confirmando si su SSD es reconocido por el sistema:
fr: Ouvrez un terminal et exécutez les commandes suivantes pour vérifier les périphériques PCI-E et la liste des périphériques de bloc, afin de confirmer que votre disque SSD est reconnu par le système :
it: Aprite un terminale ed eseguite i seguenti comandi per controllare i dispositivi PCI-E e l'elenco dei dispositivi di blocco, verificando se l'unità SSD è riconosciuta dal sistema:
ja: ターミナルを開き、以下のコマンドを実行してPCI-Eデバイスとブロック・デバイス・リストをチェックし、SSDがシステムに認識されているかどうかを確認します：
zh_cn: 打开终端，执行以下命令检查 PCI-E 设备和块设备列表，确认系统是否能识别固态硬盘：

source: You should see information similar to ``NVMe SSD`` or the specific model name, along with a new block device (e.g., ``/dev/nvme0n1``).
de: Sie sollten Informationen wie ``NVMe SSD`` oder den spezifischen Modellnamen sehen, zusammen mit einem neuen Blockgerät (z.B. ``/dev/nvme0n1``).
es: Debería ver información similar a ``NVMe SSD`` o el nombre específico del modelo, junto con un nuevo dispositivo de bloque (por ejemplo, ``/dev/nvme0n1``).
fr: Vous devriez voir des informations similaires à ``NVMe SSD`` ou le nom du modèle spécifique, ainsi qu'un nouveau périphérique bloc (par exemple, ``dev/nvme0n1``).
it: Dovreste vedere informazioni simili a ``NVMe SSD`` o il nome del modello specifico, insieme a un nuovo dispositivo di blocco (ad esempio, ``/dev/nvme0n1``).
ja: NVMe SSD`` または特定のモデル名のような情報と、新しいブロックデバイス（例：``/dev/nvme0n1``）が表示されるはずです。
zh_cn: 你应该会看到类似于 ``NVMe SSD`` 或特定型号名称的信息，以及一个新的块设备（例如，``/dev/nvme0n1``）。

source: **Step 4: Format the SSD**
de: **Schritt 4: Formatieren der SSD**
es: **Paso 4: Formatear el SSD**
fr: **Étape 4 : Formater le disque dur SSD**.
it: **Fase 4: Formattare l'SSD**
ja: **ステップ4：SSDのフォーマット
zh_cn: **第 4 步：格式化固态硬盘**

source: Use the ``mkfs.ext4`` command to format the SSD with the ext4 filesystem. **Please replace ``/dev/nvme0n1`` with the actual device name you identified in the previous step**.
de: Verwenden Sie den Befehl ``mkfs.ext4``, um die SSD mit dem ext4-Dateisystem zu formatieren. **Bitte ersetzen Sie ``/dev/nvme0n1`` durch den tatsächlichen Gerätenamen, den Sie im vorherigen Schritt identifiziert haben**.
es: Utilice el comando ``mkfs.ext4`` para formatear el SSD con el sistema de archivos ext4. **Sustituya ``/dev/nvme0n1`` por el nombre real del dispositivo que identificó en el paso anterior**.
fr: Utilisez la commande ``mkfs.ext4`` pour formater le SSD avec le système de fichiers ext4. **Remplacez ``dev/nvme0n1`` par le nom du périphérique que vous avez identifié à l'étape précédente**.
it: Usare il comando ``mkfs.ext4`` per formattare l'unità SSD con il filesystem ext4. **Si prega di sostituire ``/dev/nvme0n1`` con il nome effettivo del dispositivo identificato nel passaggio precedente**.
ja: mkfs.ext4``コマンドを使ってSSDをext4ファイルシステムでフォーマットします。/dev/nvme0n1``を前のステップで確認した実際のデバイス名に置き換えてください**。
zh_cn: 使用 ``mkfs.ext4`` 命令用 ext4 文件系统格式化固态硬盘。**请将 ``/dev/nvme0n1`` 替换为上一步中确定的实际设备名称**。

source: Formatting will erase all data on the SSD. Proceed with caution!
de: Beim Formatieren werden alle Daten auf der SSD gelöscht. Gehen Sie mit Vorsicht vor!
es: El formateo borrará todos los datos de la unidad SSD. Proceda con precaución!
fr: Le formatage efface toutes les données du disque dur SSD. Procédez avec prudence !
it: La formattazione cancellerà tutti i dati presenti sull'unità SSD. Procedere con cautela!
ja: フォーマットを行うと、SSD上のすべてのデータが消去されます。注意して行ってください！
zh_cn: 格式化将删除固态硬盘上的所有数据。请谨慎操作！

source: The system might prompt you about detecting a partition table; type ``y`` and press ``Enter`` to continue.
de: Es kann sein, dass das System Sie auffordert, eine Partitionstabelle zu erkennen; geben Sie ``y`` ein und drücken Sie ``Enter``, um fortzufahren.
es: Es posible que el sistema te pregunte sobre la detección de una tabla de particiones; escribe ``y`` y pulsa ``Enter`` para continuar.
fr: Le système peut vous demander de détecter une table de partition ; tapez ``y`` et appuyez sur ``Enter`` pour continuer.
it: Il sistema potrebbe chiedere di rilevare una tabella di partizione; digitare ``y`` e premere ``Invio`` per continuare.
ja: y`` とタイプし、``Enter`` を押して続行します。
zh_cn: 系统可能会提示检测分区表；键入 ``y`` 并按``Enter``继续。

source: After formatting is complete, use ``lsblk`` again to confirm the device status.
de: Nachdem die Formatierung abgeschlossen ist, verwenden Sie ``lsblk`` erneut, um den Gerätestatus zu bestätigen.
es: Una vez finalizado el formateo, vuelva a utilizar ``lsblk`` para confirmar el estado del dispositivo.
fr: Une fois le formatage terminé, utilisez à nouveau ``lsblk`` pour confirmer l'état du périphérique.
it: Al termine della formattazione, utilizzare nuovamente ``lsblk`` per confermare lo stato del dispositivo.
ja: フォーマットが完了したら、もう一度 ``lsblk`` を使ってデバイスの状態を確認する。
zh_cn: 格式化完成后，再次使用 ``lsblk`` 确认设备状态。

source: Now, ``/dev/nvme0n1`` should no longer have an associated mount point.
de: Nun sollte ``/dev/nvme0n1`` keinen zugehörigen Einhängepunkt mehr haben.
es: Ahora, ``/dev/nvme0n1`` ya no debería tener un punto de montaje asociado.
fr: Maintenant, ``dev/nvme0n1`` ne devrait plus avoir de point de montage associé.
it: Ora, ``/dev/nvme0n1'' non dovrebbe più avere un punto di montaggio associato.
ja: これで、``/dev/nvme0n1`` には関連するマウントポイントがなくなったはずである。
zh_cn: 现在，`/dev/nvme0n1`` 不再有关联的挂载点。

source: **Step 5: Mount the SSD**
de: **Schritt 5: Einhängen der SSD**
es: **Paso 5: Montar el SSD**
fr: **Étape 5 : Monter le disque dur SSD**.
it: **Fase 5: Montare l'SSD**
ja: **ステップ5：SSDのマウント
zh_cn: **第 5 步：安装固态硬盘**

source: Create a directory to serve as the mount point for the SSD. For example, create a directory named ``SSD`` in the user's home directory:
de: Erstellen Sie ein Verzeichnis, das als Einhängepunkt für die SSD dient. Erstellen Sie beispielsweise ein Verzeichnis namens ``SSD`` im Home-Verzeichnis des Benutzers:
es: Cree un directorio que sirva como punto de montaje para el SSD. Por ejemplo, cree un directorio llamado ``SSD`` en el directorio personal del usuario:
fr: Créez un répertoire qui servira de point de montage pour le SSD. Par exemple, créez un répertoire nommé ``SSD`` dans le répertoire personnel de l'utilisateur :
it: Creare una directory che funga da punto di montaggio per l'SSD. Ad esempio, creare una directory denominata ``SSD`` nella home directory dell'utente:
ja: SSDのマウントポイントとなるディレクトリを作成します。例えば、ユーザーのホームディレクトリに ``SSD`` という名前のディレクトリを作成する：
zh_cn: 创建一个目录作为固态硬盘的挂载点。例如，在用户的主目录下创建一个名为 ``SSD`` 的目录：

source: Manually mount the SSD to this directory:
de: Binden Sie die SSD manuell in dieses Verzeichnis ein:
es: Monte manualmente el SSD en este directorio:
fr: Monter manuellement le disque SSD dans ce répertoire :
it: Montare manualmente l'SSD in questa directory:
ja: SSDをこのディレクトリに手動でマウントする：
zh_cn: 手动将固态硬盘挂载到此目录：

source: To make the system automatically mount the SSD on every boot, you need to edit the ``/etc/fstab`` file:
de: Um das System dazu zu bringen, die SSD bei jedem Start automatisch einzuhängen, müssen Sie die Datei ``/etc/fstab`` bearbeiten:
es: Para que el sistema monte automáticamente el SSD en cada arranque, es necesario editar el archivo ``/etc/fstab``:
fr: Pour que le système monte automatiquement le SSD à chaque démarrage, vous devez éditer le fichier ``/etc/fstab`` :
it: Per fare in modo che il sistema monti automaticamente l'unità SSD a ogni avvio, è necessario modificare il file ``/etc/fstab``:
ja: 起動時にシステムが自動的にSSDをマウントするようにするには、``/etc/fstab``ファイルを編集する必要がある：
zh_cn: 要让系统在每次启动时自动加载固态硬盘，你需要编辑``/etc/fstab``文件：

source: Add the following line at the end of the file. **Again, be sure to replace the device name and mount path with your actual names**:
de: Fügen Sie die folgende Zeile am Ende der Datei ein. **Ersetzen Sie auch hier den Gerätenamen und den Einhängepfad durch Ihre tatsächlichen Namen**:
es: Añade la siguiente línea al final del archivo. **De nuevo, asegúrese de reemplazar el nombre del dispositivo y la ruta de montaje con sus nombres reales**:
fr: Ajoutez la ligne suivante à la fin du fichier. **Encore une fois, assurez-vous de remplacer le nom du périphérique et le chemin de montage par vos noms réels** :
it: Aggiungere la seguente riga alla fine del file. **Assicuratevi anche in questo caso di sostituire il nome del dispositivo e il percorso di montaggio con i vostri nomi reali**:
ja: ファイルの最後に以下の行を追加する。**デバイス名とマウント・パスは必ず実際の名前に置き換えてください**：
zh_cn: 在文件末尾添加以下一行。**另外，请务必将设备名称和挂载路径替换为实际名称**：

source: This assumes your username is ``pi`` and the mount point is ``/home/pi/SSD``. Modify according to your actual setup.
de: Dies setzt voraus, dass Ihr Benutzername ``pi`` ist und der Einhängepunkt ``/home/pi/SSD`` lautet. Ändern Sie es entsprechend Ihrer tatsächlichen Einrichtung.
es: Esto supone que su nombre de usuario es ``pi`` y el punto de montaje es ``/home/pi/SSD``. Modifíquelo según su configuración real.
fr: Ceci suppose que votre nom d'utilisateur est ``pi`` et que le point de montage est ``/home/pi/SSD``. Modifiez en fonction de votre configuration réelle.
it: Questo presuppone che il nome utente sia ``pi`` e che il punto di mount sia ``/home/pi/SSD``. Modificare in base alla propria configurazione attuale.
ja: これは、ユーザー名が ``pi`` で、マウントポイントが ``/home/pi/SSD`` であると仮定しています。実際のセットアップに応じて変更してください。
zh_cn: 假设用户名为 ``pi``，挂载点为 ``/home/pi/SSD``。请根据实际设置进行修改。

source: Press ``Ctrl+X``, ``Y``, ``Enter`` to save and exit.
de: Drücken Sie ``Strg+X``, ``Y``, ``Eingabe`` zum Speichern und Beenden.
es: Pulsa ``Ctrl+X``, ``Y``, ``Enter`` para guardar y salir.
fr: Appuyez sur ``Ctrl+X``, ``Y``, ``Enter`` pour sauvegarder et quitter.
it: Premere ``Ctrl+X``, ``Y``, ``Enter`` per salvare e uscire.
ja: Ctrl+X``, ``Y``, ``Enter`` を押して保存し、終了する。
zh_cn: 按 ``Ctrl+X``, ``Y``, ``Enter` 保存并退出。

source: Execute the following command to apply the mount, or simply reboot the Raspberry Pi:
de: Führen Sie den folgenden Befehl aus, um den Mount durchzuführen, oder starten Sie den Raspberry Pi einfach neu:
es: Ejecute el siguiente comando para aplicar el montaje, o simplemente reinicie la Raspberry Pi:
fr: Exécutez la commande suivante pour appliquer le montage, ou redémarrez simplement le Raspberry Pi :
it: Eseguire il seguente comando per applicare il montaggio, oppure riavviare semplicemente il Raspberry Pi:
ja: 以下のコマンドを実行してマウントを適用するか、単にRaspberry Piを再起動する：
zh_cn: 执行以下命令应用挂载，或者直接重启 Raspberry Pi：

source: After rebooting, you can use the ``df -h`` command to check if the SSD is successfully mounted:
de: Nach dem Neustart können Sie den Befehl ``df -h`` verwenden, um zu überprüfen, ob die SSD erfolgreich gemountet wurde:
es: Después de reiniciar, puede utilizar el comando ``df -h`` para comprobar si la unidad SSD se ha montado correctamente:
fr: Après le redémarrage, vous pouvez utiliser la commande ``df -h`` pour vérifier si le SSD est monté avec succès :
it: Dopo il riavvio, è possibile utilizzare il comando ``df -h`` per verificare se l'unità SSD è stata montata correttamente:
ja: 再起動後、``df -h`` コマンドを使ってSSDが正常にマウントされているかどうかを確認することができる：
zh_cn: 重启后，可以使用 ``df -h`` 命令检查固态硬盘是否已成功挂载：

source: You should see ``/dev/nvme0n1`` mounted at ``/home/pi/SSD``.
de: Sie sollten ``/dev/nvme0n1`` unter ``/home/pi/SSD`` eingebunden sehen.
es: Deberías ver ``/dev/nvme0n1`` montado en ``/home/pi/SSD``.
fr: Vous devriez voir ``dev/nvme0n1`` monté sur ``/home/pi/SSD``.
it: Si dovrebbe vedere ``/dev/nvme0n1`` montato su ``/home/pi/SSD``.
ja: home/pi/SSD``に ``/dev/nvme0n1`` がマウントされているはずである。
zh_cn: 你应该看到 ``/dev/nvme0n1`` 被挂载到 ``/home/pi/SSD`` 中。

source: **Step 6: (Optional) Test Read/Write Speed**
de: **Schritt 6: (optional) Test der Lese-/Schreibgeschwindigkeit**
es: **Paso 6: (Opcional) Prueba de velocidad de lectura/escritura**
fr: **Étape 6 : (Facultatif) Test de la vitesse de lecture/écriture**
it: **Fase 6: (opzionale) Test della velocità di lettura/scrittura**
ja: **ステップ6：（オプション）読み取り/書き込み速度のテスト**。
zh_cn: **第 6 步：（可选）测试读/写速度**

source: To get more accurate test results, you can first clear the filesystem cache:
de: Um genauere Testergebnisse zu erhalten, können Sie zunächst den Dateisystem-Cache löschen:
es: Para obtener resultados más precisos, primero puede borrar la caché del sistema de archivos:
fr: Pour obtenir des résultats de test plus précis, vous pouvez d'abord vider le cache du système de fichiers :
it: Per ottenere risultati più precisi, si può prima cancellare la cache del filesystem:
ja: より正確なテスト結果を得るには、まずファイルシステムのキャッシュをクリアする：
zh_cn: 要获得更准确的测试结果，可以先清除文件系统缓存：

source: Test write speed (writes an approximately 2GB file):
de: Testschreibgeschwindigkeit (schreibt eine ca. 2 GB große Datei):
es: Velocidad de escritura de prueba (escribe un archivo de aproximadamente 2 GB):
fr: Test de la vitesse d'écriture (écriture d'un fichier d'environ 2 Go) :
it: Velocità di scrittura di prova (scrive un file di circa 2 GB):
ja: 書き込み速度のテスト（約2GBのファイルを書き込む）：
zh_cn: 测试写入速度（写入约 2GB 的文件）：

source: Test read speed (reads the file just written):
de: Test der Lesegeschwindigkeit (liest die gerade geschriebene Datei):
es: Prueba la velocidad de lectura (lee el archivo que se acaba de escribir):
fr: Test de la vitesse de lecture (lecture du fichier qui vient d'être écrit) :
it: Prova la velocità di lettura (legge il file appena scritto):
ja: 読み取り速度のテスト（書き込まれたばかりのファイルを読み取る）：
zh_cn: 测试读取速度（读取刚写入的文件）：

source: After testing, delete the test file:
de: Nach dem Test löschen Sie die Testdatei:
es: Después de la prueba, elimine el archivo de prueba:
fr: Après le test, supprimez le fichier de test :
it: Dopo il test, cancellare il file di prova:
ja: テスト終了後、テストファイルを削除する：
zh_cn: 测试结束后，删除测试文件：

source: Read/write speeds are affected by various factors like the SSD model, Raspberry Pi load, etc. The test results are for reference only.
de: Die Lese-/Schreibgeschwindigkeiten werden durch verschiedene Faktoren wie das SSD-Modell, die Belastung des Raspberry Pi usw. beeinflusst. Die Testergebnisse sind nur als Referenz gedacht.
es: Las velocidades de lectura/escritura se ven afectadas por varios factores como el modelo de SSD, la carga de Raspberry Pi, etc. Los resultados de las pruebas son solo de referencia.
fr: Les vitesses de lecture/écriture sont affectées par divers facteurs tels que le modèle de SSD, la charge du Raspberry Pi, etc. Les résultats des tests sont donnés à titre indicatif.
it: Le velocità di lettura/scrittura sono influenzate da vari fattori come il modello di SSD, il carico del Raspberry Pi, ecc. I risultati dei test sono solo di riferimento.
ja: 読み書き速度は、SSDモデルやRaspberry Piの負荷など、さまざまな要因に影響されます。テスト結果は参考値です。
zh_cn: 读/写速度受 SSD 型号、Raspberry Pi 负载等多种因素影响。测试结果仅供参考。

source: At this point, you have successfully configured the M.2 NVMe SSD as expanded storage for your Raspberry Pi 5.
de: Zu diesem Zeitpunkt haben Sie die M.2 NVMe SSD erfolgreich als erweiterten Speicher für Ihren Raspberry Pi 5 konfiguriert.
es: En este punto, ha configurado correctamente la SSD M.2 NVMe como almacenamiento ampliado para su Raspberry Pi 5.
fr: À ce stade, vous avez configuré avec succès le SSD M.2 NVMe en tant que stockage étendu pour votre Raspberry Pi 5.
it: A questo punto, è stata configurata con successo l'unità SSD M.2 NVMe come memoria estesa per il Raspberry Pi 5.
ja: この時点で、M.2 NVMe SSDをRaspberry Pi 5の拡張ストレージとして設定することに成功しました。
zh_cn: 至此，您已成功将 M.2 NVMe 固态硬盘配置为 Raspberry Pi 5 的扩展存储。
