Repository: lafvintech/LAFVIN-M.2-NVMe-SSD-Adapter-For-RPI5
Catalog: docs/locales/*/LC_MESSAGES/Tutorial/3.booting_from_ssd.po
Languages: de, es, fr, it, ja, zh_cn

source: 3. Using SSD as the System Disk
de: 3. Verwendung einer SSD als Systemfestplatte
es: 3. Uso de SSD como disco del sistema
fr: 3. Utilisation d'un disque SSD comme disque système
it: 3. Utilizzo di un'unità SSD come disco di sistema
ja: 3.SSDをシステムディスクとして使用する
zh_cn: 3.使用固态硬盘作为系统盘

source: This chapter will guide you on how to configure an M.2 NVMe SSD as the primary system disk for your Raspberry Pi 5, enabling you to boot and run the system from the SSD.
de: In diesem Kapitel erfahren Sie, wie Sie eine M.2 NVMe-SSD als primäre Systemfestplatte für Ihren Raspberry Pi 5 konfigurieren, damit Sie das System von der SSD booten und ausführen können.
es: Este capítulo le guiará sobre cómo configurar un SSD M.2 NVMe como disco de sistema primario para su Raspberry Pi 5, permitiéndole arrancar y ejecutar el sistema desde el SSD.
fr: Ce chapitre vous explique comment configurer un disque SSD M.2 NVMe en tant que disque système principal pour votre Raspberry Pi 5, ce qui vous permet de démarrer et d'exécuter le système à partir du disque SSD.
it: Questo capitolo spiega come configurare un'unità SSD M.2 NVMe come disco di sistema primario per il Raspberry Pi 5, consentendo di avviare ed eseguire il sistema dall'unità SSD.
ja: この章では、M.2 NVMe SSD を Raspberry Pi 5 のプライマリシステムディスクとして設定し、SSD からシステムをブートして実行できるようにする方法を説明します。
zh_cn: 本章将指导您如何配置 M.2 NVMe 固态硬盘作为 Raspberry Pi 5 的主系统盘，使您能够从固态硬盘启动和运行系统。

source: Before starting, ensure you have completed **Steps 1 through 4** from the previous chapter **"2. Using SSD as Expanded Storage (SD Card + SSD)"**, including: * Modifying the boot configuration (``/boot/firmware/config.txt``) * Correctly installing the M.2 adapter and SSD * Confirming the system recognizes the SSD (using ``lspci`` and ``lsblk``) * Formatting the SSD with the ext4 filesystem (using ``mkfs.ext4``)
de: Bevor Sie beginnen, stellen Sie sicher, dass Sie die **Schritte 1 bis 4** aus dem vorherigen Kapitel **"2. Verwendung von SSD als erweiterter Speicher (SD-Karte + SSD)"** abgeschlossen haben, einschließlich: * Modifizieren der Bootkonfiguration (``/boot/firmware/config.txt``) * Korrekte Installation des M.2 Adapters und der SSD * Bestätigen, dass das System die SSD erkennt (mit ``lspci`` und ``lsblk``) * Formatieren der SSD mit dem ext4 Dateisystem (mit ``mkfs.ext4``)
es: Antes de empezar, asegúrate de haber completado los **pasos 1 a 4** del capítulo anterior **"2. Uso del SSD como almacenamiento expandido (tarjeta SD + SSD)**", incluyendo: * Modificar la configuración de arranque (``/boot/firmware/config.txt``) * Instalar correctamente el adaptador M.2 y el SSD * Confirmar que el sistema reconoce el SSD (usando ``lspci`` y ``lsblk``) * Formatear el SSD con el sistema de archivos ext4 (usando ``mkfs.ext4``)
fr: Avant de commencer, assurez-vous d'avoir terminé les **étapes 1 à 4** du chapitre précédent **"2. Utilisation d'un disque SSD comme stockage étendu (carte SD + disque SSD)**", y compris : * Modifier la configuration de démarrage (``/boot/firmware/config.txt``) * Installer correctement l'adaptateur M.2 et le SSD * Confirmer que le système reconnaît le SSD (en utilisant ``lspci`` et ``lsblk``) * Formater le SSD avec le système de fichiers ext4 (en utilisant ``mkfs.ext4``)
it: Prima di iniziare, assicurarsi di aver completato i **Passi da 1 a 4** del capitolo precedente **"2. Uso dell'unità SSD come memoria espansa (scheda SD + SSD)"**, tra cui: * Modificare la configurazione di avvio (``/boot/firmware/config.txt``) * Installare correttamente l'adattatore M.2 e l'SSD * Confermare che il sistema riconosce l'SSD (usando ``lspci`` e ``lsblk``) * Formattare l'SSD con il filesystem ext4 (usando ``mkfs.ext4``)
ja: 開始する前に、前章の **Step 1～4** が完了していることを確認してください：* ブート設定の変更 (``/boot/firmware/config.txt``) * M.2 アダプターと SSD を正しく取り付ける * システムが SSD を認識することを確認する (``lspci`` と ``lsblk`` を使用) * SSD を ext4 ファイルシステムでフォーマットする (``mkfs.ext4`` を使用)
zh_cn: 在开始之前，请确保已完成上一章**"2.使用固态硬盘作为扩展存储（SD 卡 + 固态硬盘）"**中的**步骤 1 至 4**，包括* 修改启动配置 (``/boot/firmware/config.txt``) * 正确安装 M.2 适配器和固态硬盘 * 确认系统可识别固态硬盘（使用 ``lspci` 和 ``lsblk`） * 使用 ext4 文件系统格式化固态硬盘（使用 ``mkfs.ext4`)

source: **Do not perform Step 5 (Mounting the SSD) or Step 6 (Testing Speed) from the previous chapter.**
de: **Führen Sie Schritt 5 (Einbau der SSD) und Schritt 6 (Geschwindigkeitstests) aus dem vorherigen Kapitel nicht aus.**
es: **No realice el Paso 5 (Montaje de la unidad SSD) ni el Paso 6 (Pruebas de velocidad) del capítulo anterior
fr: **N'effectuez pas l'étape 5 (Montage du disque SSD) ou l'étape 6 (Test de la vitesse) du chapitre précédent.
it: **Non eseguire il passo 5 (Montaggio dell'SSD) o il passo 6 (Test della velocità) del capitolo precedente.
ja: **前章のステップ5（SSDのマウント）およびステップ6（速度のテスト）は実行しないでください。
zh_cn: **请勿执行上一章的第 5 步（安装固态硬盘）或第 6 步（测试速度）**。

source: **Step 1: Enable and Connect VNC**
de: **Schritt 1: VNC aktivieren und verbinden**
es: **Paso 1: Activar y conectar VNC**
fr: **Étape 1 : Activer et connecter VNC**
it: **Fase 1: Abilitare e collegare VNC**
ja: **ステップ1：VNCを有効にして接続する**。
zh_cn: **第 1 步：启用并连接 VNC**

source: If you haven't enabled the VNC server yet, enable it via ``raspi-config`` or the desktop environment's settings. * Enter ``sudo raspi-config`` in the terminal * Select ``Interface Options`` -> ``VNC`` -> ``Yes``.
de: Wenn Sie den VNC-Server noch nicht aktiviert haben, aktivieren Sie ihn über ``raspi-config`` oder die Einstellungen der Desktop-Umgebung. * Geben Sie ``sudo raspi-config`` im Terminal ein * Wählen Sie ``Interface Options`` -> ``VNC`` -> ``Yes``.
es: Si aún no has habilitado el servidor VNC, habilítalo a través de ``raspi-config`` o la configuración del entorno de escritorio. * Introduce ``sudo raspi-config`` en el terminal * Selecciona ``Interface Options`` -> ``VNC`` -> ``Yes``.
fr: Si vous n'avez pas encore activé le serveur VNC, activez-le via ``raspi-config`` ou les paramètres de l'environnement de bureau. * Entrez ``sudo raspi-config`` dans le terminal * Sélectionnez ``Options d'interface`` -> ``VNC`` -> ``Oui``.
it: Se non avete ancora abilitato il server VNC, abilitatelo tramite ``raspi-config`` o le impostazioni dell'ambiente desktop. * Inserire ``sudo raspi-config`` nel terminale * Selezionare ``Opzioni interfaccia`` -> ``VNC`` -> ``Sì``.
ja: まだVNCサーバーを有効にしていない場合は、``raspi-config`` またはデスクトップ環境の設定で有効にしてください。* ターミナルで ``sudo raspi-config`` と入力する。 ``Interface Options`` -> ``VNC`` -> ``Yes`` を選択する。
zh_cn: 如果尚未启用 VNC 服务器，请通过 ``raspi-config`` 或桌面环境设置启用。* 在终端中输入 ``sudo raspi-config`` * 选择 ``Interface Options`` -> ``VNC`` -> ``Yes``。

source: Using a VNC Viewer client or similar software, connect to the Raspberry Pi's desktop environment from your computer.
de: Verwenden Sie einen VNC-Viewer-Client oder eine ähnliche Software, um von Ihrem Computer aus eine Verbindung zur Desktop-Umgebung des Raspberry Pi herzustellen.
es: Utilizando un cliente VNC Viewer o un software similar, conéctese al entorno de escritorio de la Raspberry Pi desde su ordenador.
fr: À l'aide d'un client VNC Viewer ou d'un logiciel similaire, connectez-vous à l'environnement de bureau du Raspberry Pi depuis votre ordinateur.
it: Utilizzando un client VNC Viewer o un software simile, collegarsi all'ambiente desktop del Raspberry Pi dal proprio computer.
ja: VNC Viewerクライアントなどを使って、パソコンからRaspberry Piのデスクトップ環境に接続します。
zh_cn: 使用 VNC 查看器客户端或类似软件，从电脑连接到 Raspberry Pi 的桌面环境。

source: **Step 2: Copy the System using SD Card Copier**
de: **Schritt 2: Kopieren des Systems mit dem SD-Karten-Kopierer**
es: **Paso 2: Copiar el Sistema usando el Copiador de Tarjetas SD**
fr: **Étape 2 : Copier le système à l'aide du copieur de carte SD**
it: **Fase 2: Copiare il sistema utilizzando la copiatrice di schede SD**
ja: **ステップ2：SDカードコピー機を使ってシステムをコピーする。
zh_cn: **步骤 2：使用 SD 卡复制器复制系统**

source: In the Raspberry Pi's desktop environment, find and open the "SD Card Copier" tool (usually under the "Accessories" menu).
de: Suchen Sie in der Desktop-Umgebung des Raspberry Pi das Tool "SD-Karten-Kopierer" (normalerweise unter dem Menü "Zubehör") und öffnen Sie es.
es: En el entorno de escritorio de la Raspberry Pi, busque y abra la herramienta "SD Card Copier" (normalmente en el menú "Accesorios").
fr: Dans l'environnement de bureau du Raspberry Pi, recherchez et ouvrez l'outil "Copieur de carte SD" (généralement dans le menu "Accessoires").
it: Nell'ambiente desktop del Raspberry Pi, trovare e aprire lo strumento "Copiatore di schede SD" (di solito nel menu "Accessori").
ja: Raspberry Piのデスクトップ環境で、"SD Card Copier "ツールを探して開きます。
zh_cn: 在 Raspberry Pi 的桌面环境中，找到并打开 "SD Card Copier" 工具（通常在 "Accessories" 菜单下）。

source: In the "Copy From Device" dropdown menu, select your SD card device (usually ``/dev/mmcblk0``).
de: Wählen Sie im Dropdown-Menü "Copy From Device" Ihr SD-Kartengerät aus (normalerweise ``/dev/mmcblk0``).
es: En el menú desplegable "Copiar desde dispositivo", seleccione el dispositivo de su tarjeta SD (normalmente ``/dev/mmcblk0``).
fr: Dans le menu déroulant "Copy From Device", sélectionnez le périphérique de votre carte SD (généralement ``dev/mmcblk0``).
it: Nel menu a discesa "Copia da dispositivo", selezionare il dispositivo della scheda SD (di solito ``/dev/mmcblk0``).
ja: Copy From Device "ドロップダウンメニューで、SDカードデバイス（通常は``/dev/mmcblk0``）を選択します。
zh_cn: 在 "Copy From Device" 下拉菜单中，选择 SD 卡设备（通常为 ``/dev/mmcblk0``）。

source: In the "Copy To Device" dropdown menu, select your NVMe SSD device (e.g., ``/dev/nvme0n1``).
de: Wählen Sie im Dropdown-Menü "Copy To Device" Ihr NVMe-SSD-Gerät aus (z. B. ``/dev/nvme0n1``).
es: En el menú desplegable "Copiar en dispositivo", seleccione su dispositivo SSD NVMe (por ejemplo, ``/dev/nvme0n1``).
fr: Dans le menu déroulant "Copy To Device", sélectionnez votre périphérique SSD NVMe (par exemple, ``dev/nvme0n1``).
it: Nel menu a discesa "Copia su dispositivo", selezionare il dispositivo SSD NVMe (ad esempio, ``/dev/nvme0n1'').
ja: Copy To Device "ドロップダウンメニューで、NVMe SSDデバイス（例： ``/dev/nvme0n1``）を選択します。
zh_cn: 在 "Copy To Device" 下拉菜单中，选择你的 NVMe SSD 设备（例如，``/dev/nvme0n1``）。

source: **Make sure to check the "New Partition UUIDs"** option. This is crucial to avoid partition UUID conflicts during boot.
de: **Stellen Sie sicher, dass Sie die Option "Neue Partitions-UUIDs"** aktivieren. Dies ist wichtig, um Partitions-UUID-Konflikte beim Booten zu vermeiden.
es: **Asegúrese de marcar la opción "Nuevo UUID de partición".** Esto es crucial para evitar conflictos de UUID de partición durante el arranque.
fr: **Veillez à cocher l'option "New Partition UUIDs". C'est essentiel pour éviter les conflits d'UUID de partition au démarrage.
it: **Assicurarsi di controllare l'opzione "New Partition UUIDs". Questo è fondamentale per evitare conflitti tra gli UUID delle partizioni durante l'avvio.
ja: **"New Partition UUIDs "**オプションを必ずチェックしてください。これはブート中のパーティションUUIDの衝突を避けるために非常に重要です。
zh_cn: **确保选中 "New Partition UUIDs"** 选项。这对避免启动过程中分区 UUID 冲突至关重要。

source: Click the "Start" button to begin the copying process. This may take some time, depending on the size and speed of your SD card.
de: Klicken Sie auf die Schaltfläche "Start", um den Kopiervorgang zu starten. Dies kann je nach Größe und Geschwindigkeit Ihrer SD-Karte einige Zeit dauern.
es: Haga clic en el botón "Iniciar" para iniciar el proceso de copia. Esto puede tardar algún tiempo, dependiendo del tamaño y la velocidad de su tarjeta SD.
fr: Cliquez sur le bouton "Démarrer" pour lancer le processus de copie. Cette opération peut prendre un certain temps, en fonction de la taille et de la vitesse de votre carte SD.
it: Fare clic sul pulsante "Avvia" per avviare il processo di copia. L'operazione potrebbe richiedere del tempo, a seconda delle dimensioni e della velocità della scheda SD.
ja: Start "ボタンをクリックして、コピープロセスを開始します。SDカードのサイズや速度によって、時間がかかる場合があります。
zh_cn: 点击 "Start（开始）"按钮开始复制过程。这可能需要一些时间，具体取决于 SD 卡的大小和速度。

source: SD Card Copier - Select Source Device (SD Card)
de: SD-Karten-Kopierer - Quellgerät auswählen (SD-Karte)
es: Copiadora de tarjetas SD - Seleccionar dispositivo de origen (tarjeta SD)
fr: Copieur de carte SD - Sélection du périphérique source (carte SD)
it: Copia scheda SD - Selezionare il dispositivo di origine (scheda SD)
ja: SDカードコピー - ソースデバイス（SDカード）を選択
zh_cn: SD 卡复制器 - 选择源设备（SD 卡）

source: SD Card Copier - Select Target Device (SSD) and check New Partition UUIDs
de: SD-Karten-Kopierer - Wählen Sie das Zielgerät (SSD) und aktivieren Sie Neue Partitions-UUIDs
es: Copiadora de tarjetas SD - Seleccione Dispositivo de destino (SSD) y marque Nuevos UUID de partición
fr: Copieur de carte SD - Sélectionnez Périphérique cible (SSD) et cochez Nouvelle partition UUIDs.
it: Copia scheda SD - Selezionare Dispositivo di destinazione (SSD) e selezionare Nuova partizione UUID.
ja: SDカードコピー - ターゲットデバイス（SSD）を選択し、新しいパーティションUUIDをチェックします。
zh_cn: SD 卡复制器 - 选择目标设备（固态硬盘）并选中新分区 UUID

source: SD Card Copier - Start Copying
de: SD-Karten-Kopierer - Kopieren starten
es: Copiadora de tarjetas SD - Iniciar copia
fr: Copieur de carte SD - Démarrer la copie
it: Copiatrice di schede SD - Avvio della copia
ja: SDカードコピー - コピー開始
zh_cn: SD 卡复制器 - 开始复制

source: Wait for the copy process to complete.
de: Warten Sie, bis der Kopiervorgang abgeschlossen ist.
es: Espere a que finalice el proceso de copia.
fr: Attendez la fin du processus de copie.
it: Attendere il completamento del processo di copia.
ja: コピー処理が完了するまで待つ。
zh_cn: 等待复制过程完成。

source: **Step 3: Modify EEPROM Boot Configuration**
de: **Schritt 3: EEPROM-Boot-Konfiguration ändern**
es: **Paso 3: Modificar la configuración de arranque de la EEPROM**
fr: **Étape 3 : Modifier la configuration de l'amorçage de l'EEPROM**
it: **Fase 3: modifica della configurazione di avvio EEPROM**
ja: **ステップ3：EEPROMブート設定の変更**」。
zh_cn: **第 3 步：修改 EEPROM 启动配置**

source: After the copy is complete, maintain the VNC connection or switch back to an SSH terminal.
de: Halten Sie nach Abschluss des Kopiervorgangs die VNC-Verbindung aufrecht oder wechseln Sie zurück zu einem SSH-Terminal.
es: Una vez finalizada la copia, mantenga la conexión VNC o vuelva a un terminal SSH.
fr: Une fois la copie terminée, maintenez la connexion VNC ou revenez à un terminal SSH.
it: Al termine della copia, mantenere la connessione VNC o passare nuovamente a un terminale SSH.
ja: コピーが完了したら、VNC接続を維持するか、SSHターミナルに切り替える。
zh_cn: 复制完成后，保持 VNC 连接或切换回 SSH 终端。

source: Execute the following command to edit the EEPROM configuration:
de: Führen Sie den folgenden Befehl aus, um die EEPROM-Konfiguration zu bearbeiten:
es: Ejecute el siguiente comando para editar la configuración de la EEPROM:
fr: Exécutez la commande suivante pour modifier la configuration de l'EEPROM :
it: Eseguire il seguente comando per modificare la configurazione della EEPROM:
ja: 以下のコマンドを実行して、EEPROM構成を編集する：
zh_cn: 执行以下命令编辑 EEPROM 配置：

source: Check the file content and ensure it includes the following two lines. If they don't exist, add them:
de: Überprüfen Sie den Inhalt der Datei und vergewissern Sie sich, dass sie die folgenden beiden Zeilen enthält. Wenn sie nicht vorhanden sind, fügen Sie sie hinzu:
es: Compruebe el contenido del archivo y asegúrese de que incluye las dos líneas siguientes. Si no existen, añádalas:
fr: Vérifiez le contenu du fichier et assurez-vous qu'il contient les deux lignes suivantes. Si elles n'existent pas, ajoutez-les :
it: Controllare il contenuto del file e assicurarsi che includa le due righe seguenti. Se non esistono, aggiungerle:
ja: ファイルの内容を確認し、以下の2行が含まれていることを確認する。存在しない場合は追加してください：
zh_cn: 检查文件内容，确保包含以下两行。如果不存在，请添加：

source: ``PCIE_PROBE=1`` ensures PCIe devices are probed at boot.
de: ``PCIE_PROBE=1`` stellt sicher, dass PCIe-Geräte beim Booten geprüft werden.
es: ``PCIE_PROBE=1`` asegura que los dispositivos PCIe son sondeados en el arranque.
fr: ``PCIE_PROBE=1`` assure que les périphériques PCIe sont sondés au démarrage.
it: ``PCIE_PROBE=1`` assicura che i dispositivi PCIe siano analizzati all'avvio.
ja: PCIE_PROBE=1``は、PCIeデバイスがブート時にプローブされることを保証する。
zh_cn: `PCIE_PROBE=1`` 确保在启动时探测 PCIe 设备。

source: ``BOOT_ORDER=0xf416`` sets the boot order: Try NVMe SSD (``6``) first, then SD card (``1``), then USB (``4``), and finally network boot (``f``) if all else fails.
de: ``BOOT_ORDER=0xf416`` legt die Bootreihenfolge fest: Versuchen Sie es zuerst mit der NVMe SSD (``6``), dann mit der SD-Karte (``1``), dann mit USB (``4``) und schließlich mit dem Netzwerkboot (``f``), wenn alles andere fehlschlägt.
es: ``BOOT_ORDER=0xf416`` establece el orden de arranque: Prueba primero con el SSD NVMe (``6``), luego con la tarjeta SD (``1``), después con el USB (``4``) y finalmente con el arranque por red (``f``) si todo lo demás falla.
fr: ``BOOT_ORDER=0xf416`` définit l'ordre de démarrage : Essayer d'abord le SSD NVMe (``6``), puis la carte SD (``1``), puis l'USB (``4``), et enfin le démarrage réseau (``f``) si tout le reste échoue.
it: ``BOOT_ORDER=0xf416`` imposta l'ordine di avvio: Prova prima l'SSD NVMe (``6``), poi la scheda SD (``1``), poi l'USB (``4``) e infine l'avvio via rete (``f``) se tutto il resto fallisce.
ja: BOOT_ORDER=0xf416`` はブート順を設定します：最初に NVMe SSD (``6``) を試し、次に SD カード (``1``) を試し、次に USB (``4``) を試し、最後にネットワークブート (``f``) を試す。
zh_cn: `BOOT_ORDER=0xf416`` 设置启动顺序：首先尝试 NVMe 固态硬盘 (``6``)，然后是 SD 卡 (``1``)，然后是 USB (``4``)，最后是网络启动 (``f``)（如果其他方法都失败）。

source: Edit EEPROM Configuration
de: EEPROM-Konfiguration bearbeiten
es: Editar configuración EEPROM
fr: Modifier la configuration de l'EEPROM
it: Modifica della configurazione EEPROM
ja: EEPROM設定の編集
zh_cn: 编辑 EEPROM 配置

source: Example EEPROM Configuration Content (including PCIE_PROBE and BOOT_ORDER)
de: Beispiel EEPROM-Konfigurationsinhalt (einschließlich PCIE_PROBE und BOOT_ORDER)
es: Ejemplo de contenido de configuración EEPROM (incluyendo PCIE_PROBE y BOOT_ORDER)
fr: Exemple de contenu de configuration de l'EEPROM (y compris PCIE_PROBE et BOOT_ORDER)
it: Esempio di contenuto di configurazione EEPROM (compresi PCIE_PROBE e BOOT_ORDER)
ja: EEPROM構成内容例(PCIE_PROBEとBOOT_ORDERを含む)
zh_cn: EEPROM 配置内容示例（包括 PCIE_PROBE 和 BOOT_ORDER）

source: Press ``Ctrl+X``, then ``Y``, and finally ``Enter`` to save and exit.
de: Drücken Sie ``Ctrl+X``, dann ``Y`` und schließlich ``Enter`` zum Speichern und Beenden.
es: Pulsa ``Ctrl+X``, luego ``Y`` y, por último, ``Enter`` para guardar y salir.
fr: Appuyez sur ``Ctrl+X``, puis sur ``Y``, et enfin sur ``Enter`` pour sauvegarder et quitter.
it: Premere ``Ctrl+X``, poi ``Y`` e infine ``Enter`` per salvare e uscire.
ja: 保存して終了するには、``Ctrl+X`` を押し、次に ``Y`` を押し、最後に ``Enter`` を押す。
zh_cn: 按``Ctrl+X``，然后按``Y``，最后按``Enter`保存并退出。

source: **Step 4: Boot from SSD**
de: **Schritt 4: Booten von SSD**
es: **Paso 4: Arrancar desde SSD**
fr: **Étape 4 : Démarrage à partir du disque dur SSD**
it: **Fase 4: avvio da SSD**
ja: **ステップ4：SSDからの起動
zh_cn: **第 4 步：从固态硬盘启动**

source: Power off the Raspberry Pi 5.
de: Schalten Sie den Raspberry Pi 5 aus.
es: Apague la Raspberry Pi 5.
fr: Éteignez le Raspberry Pi 5.
it: Spegnere il Raspberry Pi 5.
ja: Raspberry Pi 5の電源を切ります。
zh_cn: 关闭 Raspberry Pi 5 的电源。

source: **Remove the SD card**.
de: **Entfernen Sie die SD-Karte**.
es: **Retira la tarjeta SD**.
fr: **Supprimez la carte SD**.
it: **Rimuovere la scheda SD**.
ja: **SDカードを取り外してください。
zh_cn: **删除 SD 卡**。

source: Reconnect the power.
de: Schalten Sie den Strom wieder ein.
es: Vuelva a conectar la alimentación.
fr: Reconnectez l'alimentation.
it: Ricollegare l'alimentazione.
ja: 電源を再接続する。
zh_cn: 重新连接电源。

source: The Raspberry Pi should now attempt to boot from the NVMe SSD. If everything is successful, the system will load and run from the SSD. You can confirm if the root filesystem (``/``) is on the NVMe device (e.g., ``/dev/nvme0n1p2``) using the ``lsblk`` or ``df -h`` command.
de: Der Raspberry Pi sollte nun versuchen, von der NVMe-SSD zu booten. Wenn alles erfolgreich ist, wird das System von der SSD geladen und ausgeführt. Sie können mit dem Befehl ``lsblk`` oder ``df -h`` überprüfen, ob sich das Root-Dateisystem (``/``) auf dem NVMe-Gerät befindet (z.B. ``/dev/nvme0n1p2``).
es: La Raspberry Pi debería ahora intentar arrancar desde el SSD NVMe. Si todo tiene éxito, el sistema se cargará y se ejecutará desde el SSD. Puede confirmar si el sistema de archivos raíz (``/``) se encuentra en el dispositivo NVMe (por ejemplo, ``/dev/nvme0n1p2``) utilizando el comando ``lsblk`` o ``df -h``.
fr: Le Raspberry Pi devrait maintenant essayer de démarrer à partir du SSD NVMe. Si tout se passe bien, le système se chargera et fonctionnera à partir du SSD. Vous pouvez confirmer que le système de fichiers racine (``/``) se trouve sur le périphérique NVMe (par exemple, ``dev/nvme0n1p2`) en utilisant la commande ``lsblk` ou ``df -h`.
it: Il Raspberry Pi dovrebbe ora tentare di avviarsi dall'unità SSD NVMe. Se tutto è andato a buon fine, il sistema verrà caricato ed eseguito dall'SSD. È possibile verificare se il filesystem principale (``/``) si trova sul dispositivo NVMe (ad esempio, ``/dev/nvme0n1p2``) utilizzando il comando ``lsblk`` o ``df -h``.
ja: Raspberry Pi は NVMe SSD からのブートを試みます。すべてが成功すれば、システムはSSDからロードされ実行されます。ルートファイルシステム (``/``) が NVMe デバイス (例: ``/dev/nvme0n1p2``) 上にあるかどうかは ``lsblk`` または ``df -h`` コマンドで確認できます。
zh_cn: 现在，Raspberry Pi 应尝试从 NVMe SSD 启动。如果一切顺利，系统将从固态硬盘加载并运行。你可以使用 `lsblk` 或 `df -h` 命令确认根文件系统（`/``）是否位于 NVMe 设备上（例如，`/dev/nvme0n1p2`）。

source: If you encounter boot issues, you can try reinserting the SD card to check the EEPROM configuration and the filesystem on the SSD.
de: Wenn Sie Probleme beim Booten haben, können Sie versuchen, die SD-Karte erneut einzulegen, um die EEPROM-Konfiguration und das Dateisystem auf der SSD zu überprüfen.
es: Si tiene problemas de arranque, puede intentar volver a insertar la tarjeta SD para comprobar la configuración de la EEPROM y el sistema de archivos de la unidad SSD.
fr: Si vous rencontrez des problèmes de démarrage, vous pouvez essayer de réinsérer la carte SD pour vérifier la configuration de l'EEPROM et le système de fichiers sur le disque SSD.
it: Se si riscontrano problemi di avvio, si può provare a reinserire la scheda SD per verificare la configurazione della EEPROM e il filesystem sull'SSD.
ja: ブートの問題が発生した場合は、SDカードを再挿入してEEPROM構成とSSD上のファイルシステムを確認してみてください。
zh_cn: 如果遇到启动问题，可以尝试重新插入 SD 卡，检查 EEPROM 配置和固态硬盘上的文件系统。
