Repository: lafvintech/LAFVIN-M.2-NVMe-SSD-Adapter-For-RPI5
Catalog: docs/locales/*/LC_MESSAGES/Tutorial/m.2_adapter_compatibility_issues.po
Languages: es, ja

source: M.2 Adapter Compatibility Issues
es: Problemas de compatibilidad del adaptador M.2
ja: M.2アダプターの互換性の問題

source: The following SSDs may have compatibility issues. While some issues may have been resolved, it is still recommended to use NVMe SSDs not listed below.
es: Las siguientes unidades SSD pueden tener problemas de compatibilidad. Aunque es posible que se hayan resuelto algunos problemas, se recomienda utilizar unidades SSD NVMe que no aparezcan en la lista.
ja: 以下のSSDには互換性の問題がある可能性があります。いくつかの問題は解決されているかもしれませんが、以下に記載されていないNVMe SSDを使用することをお勧めします。

source: Western Digital Series
es: Serie Western Digital
ja: ウェスタンデジタルシリーズ

source: Western Digital Green SN350 series
es: Serie Western Digital Green SN350
ja: ウェスタンデジタル・グリーンSN350シリーズ

source: Western Digital Blue SN550 series
es: Serie Western Digital Blue SN550
ja: ウエスタンデジタル Blue SN550シリーズ

source: Western Digital Blue SN580 series
es: Western Digital Blue serie SN580
ja: ウエスタンデジタル Blue SN580シリーズ

source: Western Digital SN740
ja: ウエスタンデジタルSN740

source: Western Digital Black SN770
es: Western Digital Negro SN770
ja: ウェスタンデジタル・ブラックSN770

source: Western Digital Black SN850 series
es: Western Digital Negro serie SN850
ja: ウェスタンデジタル・ブラックSN850シリーズ

source: Western Digital BLACK 8TB SN850X
es: Western Digital NEGRO 8TB SN850X
ja: ウエスタンデジタル BLACK 8TB SN850X

source: Other Brands
es: Otras marcas
ja: その他のブランド

source: Samsung PM991
ja: サムスンPM991

source: Kingston OM8SEP4256Q-A0
ja: キングストン OM8SEP4256Q-A0

source: Transcend 110Q (TS500GMTE110Q)
ja: トランセンド110Q (TS500GMTE110Q)

source: Corsair MP600 SSD
es: Unidad SSD Corsair MP600
ja: コルセア MP600 SSD

source: Inland tn446 nvme drive
ja: インランドTN446NVMドライブ

source: Micron 2450 SSD (Can be recognized but does not support booting from NVMe)
es: SSD Micron 2450 (se puede reconocer pero no admite el arranque desde NVMe)
ja: Micron 2450 SSD (認識できるが、NVMeからの起動はサポートしない)

source: Other NVMe SSDs equipped with the same Phison controller
es: Otras unidades SSD NVMe equipadas con el mismo controlador Phison
ja: 同じPhisonコントローラーを搭載した他のNVMe SSD

source: If you encounter any issues with your SSD, please check if it's listed above. For the best compatibility, consider using SSDs from other manufacturers or models not mentioned in this list.
es: Si tiene alg√∫n problema con su unidad SSD, compruebe si aparece en la lista anterior. Para obtener la mejor compatibilidad, considere la posibilidad de utilizar unidades SSD de otros fabricantes o modelos no mencionados en esta lista.
ja: お使いのSSDに何らかの問題が発生した場合は、上記のリストに記載されているかどうかをご確認ください。最高の互換性を得るには、このリストに記載されていない他のメーカーやモデルのSSDの使用を検討してください。
